import LocalizedStrings from "localized-strings";

export const strings = new LocalizedStrings({
  ja: {
    勇者: "ゆうしゃ",
    アーチャー: "あーちゃー",
    魔法使い: "まじしゃん",
    僧侶: "ぷりーすと",
    戦士: "せんし",
    ダンサー: "だんさー",
    テイマー: "ていまー",

    勇者詳細: "ゆうしゃ は こうげき も まほう も つかえる つよい ひとだよ。",
    アーチャー詳細:
      "あーちゃー は とおく の こうげき が できるので まんなかにするとよいよ。",
    魔法使い詳細:
      "まじしゃん は とおく の こうげき が できるので まんなかにするとよいよ。あーちゃー より こうげき に じかんが かかるよ。",
    僧侶詳細:
      "ぷりーすと は かいふく が できるよ。ぷりーすと が いると あんしん するよ。",
    戦士詳細:
      "せんし は とっても かたいよ。いちばんまえ に おくと とても よいよ。",
    ダンサー詳細:
      "だんさー は いるだけで みんながつよくなるよ。だんさー じしん は あまりつよくないよ。",
    テイマー詳細:
      "ていまー は どうぶつ を つかうこと が できるよ。とおくへ の こうげき が できるよ",

    スマッシュ: "すまっしゅ",
    ソニックブーム: "そにっくぶーむ",
    ファイア: "ふぁいあ",
    サンダー: "さんだー",
    ヒール: "ひーる",
    エアロ: "えあろ",
    ショット: "しょっと",
    ロングショット: "ろんぐしょっと",
    ガード: "がーど",
    魔狼: "まろう",

    へんせい: "へんせい",
    しゅっぱつ: "しゅっぱつ",

    スタート: "すたーと",
    もう1回: "もう１かい",
    レベルアップ: "れべるあっぷ",
    もどる: "もどる",
    とめる: "とめる",
    さいかい: "さいかい",
    いれかえ: "ばんめの きゃら を いれかえる",
    すきるいれかえ: "すきる を いれかえる",
    むずかしさ: "むずかしさ",

    ボス撃破: "ぼす げきは",
    踏破: "すてーじ とうは",
    失敗: "こうりゃく しっぱい",
    撃破数: "げきはすう",
    スペシャルボーナス: "すぺしゃる ぼーなす",
    つぎへ: "つぎへ",

    森林: "しんりん",
    砂漠: "さばく",
  },
});
