import LocalizedStrings from "localized-strings";

export const strings = new LocalizedStrings({
  ja: {
    勇者: "ゆうしゃ",
    アーチャー: "あーちゃー",
    魔法使い: "まじしゃん",
    僧侶: "ぷりーすと",
    戦士: "せんし",
    ダンサー: "だんさー",
    テイマー: "ていまー",

    スマッシュ: "すまっしゅ",
    ソニックブーム: "そにっくぶーむ",
    ファイア: "ふぁいあ",
    サンダー: "さんだー",
    ヒール: "ひーる",
    エアロ: "えあろ",
    ショット: "しょっと",
    ロングショット: "ろんぐしょっと",
    ガード: "がーど",
    魔狼: "まろう",

    スタート: "すたーと",
    もう1回: "もう１かい",
    レベルアップ: "れべるあっぷ",
    とめる: "とめる",
    さいかい: "さいかい",

    ボス撃破: "ぼす げきは",
    踏破: "すてーじ とうは",
    失敗: "こうりゃく しっぱい",
    撃破数: "げきはすう",
    スペシャルボーナス: "すぺしゃる ぼーなす",
    つぎへ: "つぎへ",

    森林: "しんりん",
    砂漠: "さばく",
  },
});
